fixed_bottleneck/heavier/httperf/test5.txt
httperf
*** Running httperf 0.9 patched by DK and RSH ***
 --client=0/1 --server=44.252.104.243 --rfile-name=/home/ubuntu/engg_533/responsetimes/rfile.txt --port=80 --uri=/ --period=e0.035 --send-buffer=4096 --recv-buffer=16384 --wsesslog=1000,0.000,input.txt
Maximum connect burst length: 2

Total: connections 1000 requests 13306 replies 12697 test-duration 35.232 s

Connection rate: 28.4 conn/s (35.2 ms/conn, <=966 concurrent connections)
Connection time [ms]: min 108.7 avg 8516.2 max 32918.5 median 7238.5 stddev 6911.8
Connection time [ms]: connect 0.5
Connection length [replies/conn]: 317.425

Request rate: 377.7 req/s (2.6 ms/req)
Request size [B]: 104.0

Reply rate [replies/s]: min 113.6 avg 360.6 max 461.6 stddev 127.4 (7 samples)
Reply time [ms]: response 153.7 transfer 0.0
Reply size [B]: header 223.0 content 2186.0 footer 0.0 (total 2409.0)
Reply status: 1xx=0 2xx=12697 3xx=0 4xx=0 5xx=0

CPU time [s]: user 22.51 system 12.72 (user 63.9% system 36.1% total 100.0%)
Net I/O: 886.5 KB/s (7.3*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
befor print loopEntered the print loop 12697 
Session rate [sess/s]: min 0.20 avg 1.14 max 1.60 stddev 0.50 (40/40)
Session: avg 1.00 connections/session
Session lifetime [s]: 8.5
Session failtime [s]: 0.0
Session length histogram: 0 0 1 2 3 1 2 7 9 2 1 0 2 1 0 1 2 0 1 1 0 0 1 0 2 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 1